// Задача 6: Напишите программу, которая 
// на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
if (number % 2 == 0)
{
    Console.WriteLine("Число является чётным  ");
}
else
{
    Console.WriteLine("Число не является чётным  ");
}

// Можно сократить с помощью тернарного оператора :

Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"{(num % 2 == 0 ? "Число является чётным" : "Число не является чётным")}");   